import React from "react";
import { useRouter } from "next/router";

import CurrentService from "../../../components/services/CurrentService";
import Head from "next/head";
import axios from "axios";

import getMainData from "../../../utils/getMainData";

const API = process.env.NEXT_PUBLIC_LOCAL_URL;

const webDesin = {
  name: "تصميم مواقع",
  description:
    "نقوم ببرمجة و تصميم مواقع إحترافية تعمل على تعزيز وجود نشاطك التجاري على الإنترنت بشكل كبير وذلك في الوقت المحدد وبأسعار تنافسيه تتناسب مع ميزانيتك نقدم خدمات تصميم مواقع الإنترنت لكلاً من:",
  hidden: false,
  sections: [
    {
      title: "ماذا سنقدم لك في يمناك",
      body: "نقوم ببرمجة و تصميم مواقع إحترافية تعمل على تعزيز وجود نشاطك التجاري على الإنترنت بشكل كبير وذلك في الوقت المحدد وبأسعار تنافسيه تتناسب مع ميزانيتك نقدم خدمات تصميم مواقع الإنترنت لكلاً من:",
      items: [
        "تصميم موقع منشأتك",
        "تصميم موقع يجسد فكرتك الخاصة",
        "تصميم موقع إخباري",
        "تصميم موقع مراكز تدريب",
        "تصميم موقع مثل حراج",
        "تصميم موقع مثل مستعمل و أوليكس و بيزات",
        "تصميم موقع عقارات",
      ],
    },
    {
      title: "أهمية تصميم مواقع إلكترونية",
      body1:
        "وجود موقع إلكتروني أصبح أمر مهم للغاية حيث أنه يشكل أداة تسويقية لا غنى عنها، فبمجرد إنشائك لموقع إلكتروني سوف تصل إلى من تريد للتعريف بنشاطك وذلك بسب التطور التكنولوجي الذي حدث في الآونة الأخيرة. وجود موقع إلكتروني يجعل تواصلك مع عملائك أسهل بغض النظر عن الموقع الجغرافي لنشاطك حيث يمكن لأي شخص من أي مكان في العالم بأن يصل إليك ويحصل على معلومات عنك وعن نشاطك وخدماتك، وجود موقع إلكتروني يعني وصولك لشريحة عملاء أكبر وبالتالي تحقيق المزيد من المبيعات والأرباح لذلك يجب أن يكون الموقع الإلكتروني غني بالمعلومات التي تساعد العميل في أن يتعرف على نشاطك وعلى الخدمات التي تقدمها. وجود موقع إلكتروني يساعدك في عرض سابقة أعمالك وشهادة العملاء الذين تعاملت معهم وقمت بخدمتهم.",
      body2:
        "عند تصميم موقع إلكتروني سوف تعزز حضورك على الإنترنت وبالتالي المساهمة في إشهار علامتك التجارية، إن تصميم موقع إلكتروني على الإنترنت هو البداية التي تضمن النجاح المتواصل لأعمالك. وجود موقع إلكتروني على الإنترنت لم يعد رفاهية بل هو متطلب لتتماشى مع متطلبات العصر الحديث علماً بأن تجاهله قد يكون أحد أسباب خروجك من المنافسة.",
      body3:
        "عليك البدء فوراً بتصميم موقعك الإلكتروني معنا نحن يُمناك رواد تصميم المواقع الإلكترونية حيث نمضي معك في رحلة تبدأ من نواة الفكرة إلى التخطيط ثم التنفيذ، لنضمن لك حضورا فعالا وتواصلاً مستمراً مع عملائك.",
      title2: "مميزات تصميم مواقع الإنترنت لدى يُمناك",
      help: "تصميم مواقع الإنترنت البداية التي تضمن النجاح المتواصل لأعمالك",
      items: [
        "تصميم مواقع الإنترنت لدينا متوافقة مع المعايير القياسية العالمية (W3C)",
        "نقدم موقع إلكتروني مطابق لأحدث التقنيات المستخدمة",
        "نقدم موقع إلكتروني متوافق مع جميع الأجهزة اللوحية",
        "نقدم موقع إلكتروني متوافق مع محركات البحث",
      ],
    },
    {
      items: [
        "نقدم موقع إلكتروني متوافق مع جميع المتصفحات",
        " ًنقدم إستشارات تسويقية مجانا",
        "نقدم موقع إلكتروني قابل للتطوير ولإضافة أي خدمات جديدة في المستقبل",
        "نقدم دعم فني على مدار السنة",
        "نقوم بحجز نطاق خاص بك يعبر عن نشاطك ",
        "نقدم إستضافة لموقعك حسب الخطط التي نوفرها وذلك لوضع ملفات موقعك عليها",
        "نقوم بتصميم تطبيق جوال لموقعك (بتكلفة إضافية)",
        "نقدم موقع إلكتروني بتصميم مميز",
        "نقدم الحماية والأمان المتكامل للموقع الإلكتروني",
        "نقدم موقع إلكتروني سهل الإستخدام",
        "نسخ إحتياطي مستمر لحفظ ملفاتك",
        "نقوم بتصميم شعار لموقعك في حال لم يكون لديك شعار (بتكلفه إضافيه)",
        "نقوم بإنشاء بريد إلكتروني رسمي مثال info@Uomnaac.com",
        "نقدم خدمة التسويق الإلكتروني لموقعك لنحقق لك مبيعات وعائد إستثماري رائع (بتكلفه إضافية)",
      ],
    },
    {
      title: "ما الذي يجعل يٌمناك أفضل خدمة تصميم مواقع إلكترونية ؟",
      body: "نحن الوجهة المثالية لتنفيذ الموقع الإلكتروني الخاص بنشاطك التجاري حيث لدينا خبرة كبيرة في مجال تصميم مواقع الإنترنت والتي تضمن لك حضوراً مستمراً وتواصلاً فعالاً مع عملائك.",
      body2:
        "نعتمد في تنفيذ مشاريع تصميم المواقع الإلكترونية على فريق عمل مميز يمتلك مهارات إبداعية وفنية عالية و التي تمكننا من إخراج الأعمال بصورة رائعة.",
      body3:
        "نمتلك الإمكانيات التي تساعدك في تحويل فكرتك الخاصة إلى موقع إلكتروني ناجح حيث نعمل معك جاهدين لتحقيق رؤيتك ، وذلك بأقل الأسعار.",
    },
    {
      title: "مراحل تصميم المواقع لدى يُمناك",
      itemsWithMuted: [
        {
          item: "طلب الخدمة",
          muted: "التقدم بطلبك لإنشاء موقع إلكترونى",
        },
        {
          item: "الأفكار",
          muted: "نبدأ بتجهيز الأفكار و التصاميم لتنفيذ الموقع",
        },
        {
          item: "التصميم",
          muted: "اختيار التصميم المثالي واعتماده من قبلك",
        },
        {
          item: "التطوير",
          muted: "البدء فى عملية البرمجة والتكويد",
        },
        {
          item: "الجودة",
          muted: "نقوم بتقييم واختبار الموقع للتأكد من عمله على أكمل وجه",
        },
        {
          item: "التسليم",
          muted: "تسليمك الموقع كامل مع تدريبك على استخدام لوحة التحكم للموقع",
        },
      ],
    },
  ],
};

const EcommerceDesign = {
  name: "تصميم متاجر إلكترونيه",
  description:
    "ظهرت أهمية تصميم متجر إلكتروني نتيجة لتغير إستخدام التقنية كثيرا خلال السنوات القليلة الماضية، حيث نرى اليوم بأن التقنية أصبحت جزأ لا يتجزأ من النسيج المجتمعي، ومن أمثلة ذلك هو استعمال التقنية في المعاملات التجارية التي أدت إلى تغيرات اقتصادية و إجتماعية سهلت عملية البيع و الشراء عبر الإنترنت من خلال المتاجر الإلكترونية و تطبيقات الجوال، مما ساهم في خلق نمط جديد من أنماط التجارة يعرف بالتجارة الإلكترونية ويشار له اختصاراً بـ e-commerce.",
  hidden: false,
  sections: [
    {
      title: "ماذا سنقدم لك في يمناك",
      body: [
        "ظهرت أهمية تصميم متجر إلكتروني نتيجة لتغير إستخدام التقنية كثيرا خلال السنوات القليلة الماضية، حيث نرى اليوم بأن التقنية أصبحت جزأ لا يتجزأ من النسيج المجتمعي، ومن أمثلة ذلك هو استعمال التقنية في المعاملات التجارية التي أدت إلى تغيرات اقتصادية و إجتماعية سهلت عملية البيع و الشراء عبر الإنترنت من خلال المتاجر الإلكترونية و تطبيقات الجوال، مما ساهم في خلق نمط جديد من أنماط التجارة يعرف بالتجارة الإلكترونية ويشار له اختصاراً بـ e-commerce.",
        "يعد قطاع التجارة الإلكترونية صناعة ناشئة بالمملكة وتأتي بالتوافق مع الرؤية المستقبلية 2030، بات هذا القطاع هو الأكثر أهمية و من أبرز المؤشرات على ذلك هو ما شهدته المملكة في السنوات الماضية من زيادة واضحة في حجم معدلات النمو حيث سجلت نمواً بنسبة 20% بشكل سنوي، إن قطاع التجارة الإلكترونية في نمو مستمر حيث بلغت حجم مبيعات التجارة الإلكترونية في المملكة 7.5 مليار ريال ومن المتوقع أن تصل بحلول عام 2030 إلى 13.4 مليار دولار.",
      ],
      title2: "أهمية تصميم متجر إلكتروني",
      body2: [
        "تصميم وبرمجة متجر إلكتروني سوف يساهم في خفض التكاليف التشغيلية بالإضافة إلى ذلك لن تحتاج إلى رأس مال كبير للبدء في إنشاء متجر إلكتروني، وكل هذا سوف يساعدك في عرض منتجاتك بأسعار مخفضة تمنحك ميزة تنافسية تجلب لك عدداً أكبر من العملاء",
        "إنشاء متجر إلكتروني يعني التحرر من قيود الزمان كما هو الحال في التجارة التقليدية حيث يمكن للعميل الوصول لمتجرك الإلكتروني في أي وقت وطوال اليوم بدلاً من مدة محددة, و هذا يعني مبيعات أكثر و بالتالي أرباح أكثر.",
        "وجود متجر إلكتروني يعني تجاوز حدود المكان, حيث أصبح بالإمكان خلق سوق عالمي وليس محلي فقط يساهم في تحقيق عائدات أعلى من الأنشطة التقليدية و جلب عدد أكبر من العملاء.",
        "إمتلاك متجر إلكتروني يعني عدم التقيد بإطار أو مساحة معينة، حيث يمكن عرض آلاف المنتجات أو الخدمات، التي تلبي خيارات العملاء و تساعدك على المنافسة في الحصول على حصة سوقية أعلى",
        "تصميم متجر إلكتروني يمكنك من تفهم إحتياجات عملائك و بالتالي القدرة على إتاحة خيارات تسوق بشكل أوسع، وهذا يساعد على تحقيق رضا العميل و بناء علاقات مثمرة معه, مما يجعل لك الأفضلية بين المنافسين.",
        "تصميم المتاجر الإلكترونية أصبح شيء مهم وخاصة في ظل التطور التكنولوجي الذي نشهده في السنوات الأخيرة لذلك لابد لك من مواكبة هذا التطور واستغلاله لعرض منتجاتك و خدماتك من أجل فتح أسواق جديدة والوصول إلى شريحة عملاء أكبر و بالتالي تحقيق دخل أعلى",
        "امتلك متجرك الآن… مع يُمناك أفضل خدمة تصميم متجر إلكتروني حيث يقوم فريق التطوير لدينا بإستخدام أحدث التقنيات وأفضل الممارسات لتصميم متجر إلكتروني إحترافي يساعدك في عرض منتجاتك بطريقة إحترافية ويزيد من مبيعاتك ويسهل عليك إدارة عمليات البيع.",
      ],
    },
    {
      title: "مميزات برمجة متجر إلكتروني لدينا",
      items: [
        "نقدم متجر إلكتروني مطابق لأحدث التقنيات المستخدمة",
        "إمكانية إضافة عدد لا نهائي من المنتجات",
        "نقدم متجر إلكتروني متوافق مع جميع الأجهزة اللوحية",
        "شات تفاعلي لكي يتم التواصل مع العملاء بكل سهولة",
      ],
      title2: "مميزات اخري",
      items2: [
        "نقدم الحماية والأمان المتكامل للمتجر الإلكتروني",
        "نقدم متجر إلكتروني متوافق مع محركات البحث",
        "نقدم متجر إلكتروني متوافق مع جميع المتصفحات",
        "نقدم متجر إلكتروني بتصميم مميز",
        "نقدم متجر إلكتروني قابل للتطوير ولإضافة أي خدمات جديدة في المستقبل",
        "نقدم متجر إلكتروني سهل الإستخدام",
        "ًنقدم استشارات تسويقية مجانا",
        "نقدم دعم فني على مدار السنة",
        "نقدم نسخ احتياطي مستمر لحفظ ملفاتك",
        "نقوم بحجز نطاق خاص بك يعبر عن نشاطك مثال www.uomnaac.com",
        "نقوم بإنشاء بريد إلكتروني رسمي مثال info@uomnaac.com",
        "نقوم بتصميم شعار إحترافي لمتجرك في حال لم يكون لديك شعار (بتكلفه إضافية)",
        "نقدم إستضافة لمتجرك حسب الخطط التي نوفرها وذلك لوضع ملفات متجرك عليها",
        "نقوم بتصميم تطبيق جوال لمتجرك (بتكلفة إضافية)",
        "نقدم خدمة التسويق الإلكتروني لمتجرك لنحقق لك مبيعات وعائد استثماري رائع (بتكلفة إضافية)",
        "إمكانية إضافة عدد لا نهائي من الأقسام الرئيسية والفرعية. ",
        "طرق دفع متعددة وآمنة",
        "يدعم أكثر من لغة ، – يدعم العديد من العملات",
        "طرق متعددة للشحن",
        "الربط مع قنوات التواصل الإجتماعي",
        "سلة مشتريات مطورة لتسهيل عملية الشراء المتعدد",
        "طباعة الفواتير بعد عمليات الشراء",
        "إمكانية عمل ختم مائي على جميع الصور بشعار الموقع لضمان عدم سرقتها",
        "نظام كوبونات الخصم والهدايا الترويجية",
        "نظام متطور للمرتجعات",
        "نظام التسويق بالعمولة – أفليت",
        "نظام تقييم المنتجات وآراء العملاء",
        "نظام المقارنة بين المنتجات",
        "نظام القوائم البريدية",
        "نظام متطور لتتبع حالة الطلب",
        "نظام تقارير المبيعات",
        "إمكانية تكبير صورة المنتج بمجرد الإشارة بالماوس على صورة المنتج",
      ],
    },
    {
      title: "ما الذي يجعل يُمناك الخيار الأفضل لتصميم متجرك الإلكتروني",
      body: [
        "لدينا جميع الإمكانيات التي نستطع من خلالها تحويل أفكاركم إلى متجر إلكتروني ناجح حيث نعمل معكم جنباً إلى جنب لتحقيق رؤيتكم وأهدافكم، وذلك بأسعار تنافسية تتناسب مع ميزانياتكم",
        "نسعى لتقديم الأفضل للمساهمة في نهضة التجارة الإلكترونية في المملكة.",
        "لدينا خبرة واسعة في مجال تصميم المتاجر الإلكترونية، حيث نساهم معكم في خلق تجربة ناجحة في مجال التجارة الإلكترونية، تضمن لكم إشهار علامتكم التجارية و تعزز طرق تواصلكم مع عملائكم.",
        "لدينا فريق عمل يتميز بالخبرة والكفاءة التي تمكنه من تصميم متاجر إلكترونية مبتكرة ذات تصاميم إحترافية عالية، آخذين بعين الإعتبار سهولة الإستخدام و مراعات تجربة المستخدم.",
        "نحن في يُمناك لا نقوم بإنشاء متاجر إلكترونيه تقليدية فحسب نحن نسعي لجعل متجركم الإلكتروني الأفضل بين المنافسين و ذلك من خلال تنفيذ أفكار إبداعية وحلول مبتكرة تساهم في نجاحكم.",
      ],
      title2: "مراحل تصميم متجر إلكتروني لدى يُمناك",
      itemsWithMuted: [
        {
          item: "طلب الخدمة",
          muted: "التقدم بطلبك لإنشاء موقع إلكترونى",
        },
        {
          item: "التحليل",
          muted:
            "فهم وتحليل فكرة وأهداف المتجر ووضع تصور كامل لما سيكون عليه المتجر، ثم نبدأ بتجهيز الأفكار والخطط التنفيذية و من ثم إنشاء وثيقة الخطط والمتطلبات النهائية والموافقة عليها من قبلك",
        },
        {
          item: "التصميم",
          muted:
            "وضع أكثر من تصور للتصميم بناءً على الأفكار والخطط و إختيار التصميم المثالي ومن ثم إعتماده من قبلك",
        },
        {
          item: "التطوير",
          muted: "البدء فى عملية البرمجة والتكويد",
        },
        {
          item: "الجودة",
          muted: "تحويل ملفات التصميم إلى برمجة متكاملة من لوحة تحكم و غيره",
        },
        {
          item: "الجودة",
          muted: "نقوم بتقييم وإختبار المتجر للتأكد من عمله على أكمل وجه",
        },
        {
          item: "التسليم",
          muted:
            "تسليمك المتجر الإلكتروني بشكل كامل، وتدريبك على إستخدام لوحة التحكم للموقع",
        },
      ],
    },
  ],
};

const SeoDesign = {
  name: "تحسين محركات البحث",
  description:
    "نقوم بتهيئة موقعك لمحركات البحث بالتعديلات البرمجية الخاضعة للمعايير القياسية لـمحركات البحث العالمية ونعمل على إشهار وتسويق موقعك للوصول لأكبر عدد من العملاء",
  hidden: false,
  sections: [
    {
      title: "اجعل أعمالك تتصدر نتائج متصفح البحث جوجل",
      body: "٩٣% من حصة السوق تمتلكها محركات بحث جوجل، مما يجعلها تتصدر قائمة الأهمية عن غيرها، فخدمات تهيئة موقعك لمحركات البحث تستهدف تحسين ظهور موقعك في جوجل أولاً.",
    },
    {
      title: "موقعك سيظهر قبل مواقع منافسيك",
      body: [
        "اجلب المزيد من الزبائن لموقعك أو متجرك، إجعل محتواك أفضل، وإجعل جوجل يؤرشف صفحات موقعك كما ينبغي أن يكون، لمزيد من الزيارات لموقع شركتك الإلكتروني، وظهور أكبر على الإنترنت والمزيد من العملاء.",
        "يعد تحسين محرك البحث أحد أكثر الجوانب أهمية للتسويق عبر الإنترنت، فمحركات البحث هي وسيلتك الأولى لجلب المزيد من الزبائن إلى موقعك أو متجرك الإلكتروني، لم يعد الأمر شيء مكمل، حيث أن الظهور في نتائج متقدمة لمحرك البحث جوجل يضمن آلاف بل ملايين الزيارات لموقعك من قبل أشخاص مهتمين بما تقدمه مما يعني إحتمالية عالية ليصبحوا عملاء من خلال :",
      ],
      items: [
        "تهيئة السيو الخارجي",
        "تهيئة السيو الداخلى",
        "إنشاء حملات PPC ناجحة",
        "تحليل السوق ونشاط الموقع",
      ],
    },
  ],
};

const DigitalDesign = {
  name: "خطط واستراتيجيات التسويق الرقمية",
  description:
    "نمنح المشاريع الناشئة والمشاريع المتعثرة حياة طويلة وأملًا جديدًا ونموًا متواصلًا، فنصنع لها خطط التسويق والمبيعات بالإضافة للخطط الإدارية والتنفيذية وغيرها من الخطط ذات الصلة.",
  hidden: false,
  sections: [
    {
      title: '" من الرؤية إلى الواقع"',
      body: [
        "لأننا نؤمن أن وجود إستراتيجية تسويقية صحيحة أمرٌ هام، إذ من خلالها يمكن رسم خريطة الوصول إلى تحقيق النجاح وإزدهار الأعمال ونموها، لـذلك أنت بحـاجة لـخطة إستـراتيجية محكمة لبنـاء حمـلات إبـداعية مُبتكرة قـادرة عـلـى الإستحـواذ على انتبـاه جمـهـورك، فاخترنا في “يُمناك” مجموعة من خبراء صناعة الخطط والإستراتيجيات التسويقية وأكثرهم إحترافاً.",
        "عند اختيارك “يُمناك” لبناء خطتك التسويقية، فإننا نمكنك من وضع يدك على طرف الخيط لجذب العملاء وتسريع المبيعات من خلال جمع البيانـات وتحويلها إلى أفكـار وإستراتيجيـات فعّـالة لتحقيق توقعـاتك ورسم تموضعـك فـي السـوق من خلال:",
      ],
      items: [
        "أفكار إبداعية",
        "تخطيط مثالي، وتحديد دقيق لأهدافك التسويقية المراد تحقيقها",
        "المتسوق الخفي",
        "بناء رؤى واضحة حول الجمهور وشخصيات العملاء ووضع إستهداف صحيح.",
        "دراسة تجربة العميل",
        "إجراء تحليلاً مفصلاً لمنافسيك.",
        "جدول الفعاليات المناسبة لعلامتك التجارية",
        "تحليل نقاط القوة والضعف والفرص والتهديدات.",
        "إستراتيجيات التواصل",
      ],
    },
  ],
};

const MobileApp = {
  name: "تصميم تطبيقات الجوال",
  description:
    "يسعى فريق تصميم تطبيقات الجوال في يُمناك الرقمية دائما إلى تقديم الأفضل حيث نساعدك في تحويل فكرتك الخاصة إلى تطبيق جوال يساعدك في تنمية أعمالك على الإنترنت",
  hidden: false,
  sections: [
    {
      body: "يسعى فريق تصميم تطبيقات الجوال في يُمناك الرقمية دائما إلى تقديم الأفضل حيث نساعدك في تحويل فكرتك الخاصة إلى تطبيق جوال يساعدك في تنمية أعمالك على الإنترنت",
      items: ["تصميم تطبيقات الأندرويد", "تصميم تطبيقات الأيفون"],
    },
    {
      title: "أهمية تصميم تطبيقات الجوال",
      body: [
        "تكمن أهمية تصميم تطبيقات الجوال في أن أجهزة الجوال أصبحت في متناول اليد لجميع الناس، حيث تشير الإحصائيات إلى أن هناك ما يزيد عن ٢ مليار هاتف ذكي حول العالم وهذا الرقم في تزايد مستمر، فوفقاً للدراسة التي أعدتها مؤسسة آي إتش إس ( (IHS و التي تعد مصدراً مهما للمعلومات والتوقعات العالمية، فإنه من المتوقع أن ترتفع عدد أجهزة الهاتف الذكي المستخدمة في العالم في العام 2020 إلى أكثر من 6 مليار جهاز، بالإضافة إلى ذلك فإن إستخدام الهواتف الذكية تجاوز إستخدام الأجهزة المكتبية والمحمولة حيث تشير الإحصائيات إلى أن 76% من مستخدمي الإنترنت يفضلون إستخدام الهواتف الذكية بدلاً عن متصفحات أجهزة الكمبيوتر، ومازال الفارق يتسع",
        "الإنتشار الواسع لإستخدام الهواتف الذكية خلق فرصة تسويقية رائعة سمحت للشركات والأفراد بإستغلالها في التسويق للمنتجات و عرض الخدمات و التمكن من التواصل مع العملاء بشكل أفضل وأسرع و ذلك من خلال برمجة و تصميم تطبيقات الجوال، فقد أصبحت تطبيقات الجوال في الوقت الحالي أداة تسويقية فعالة تتفوق على العديد من الأدوات الأخرى حيث خلقت حصة سوقية كبيرة يجب أن تسارع لإستثمارها",
        "تصميم تطبيق جوال خاص بمنتجاتك وخدماتك سوف ينقل أعمالك إلى منحنى آخر، من خلال زيادة وصلك لشريحة عملاء أكبر وبالتالي تحقيق المزيد من المبيعات والأرباح",
        "تصميم تطبيق جوال سوف يعزز قنوات التواصل بينك وبين عملائك و بالتالي المساهمة في إشهار علامتك التجارية و بالتالي زيادة قيمتها السوقية لذلك عليك البدء فوراً بتصميم تطبيق جوال",
        "اطلب الآن تطبيقك مع يُمناك أفضل خدمة تصميم تطبيقات الجوال، فنحن نساعدك في تحويل فكرتك الخاصة إلى تطبيق جوال يساهم في تنمية أعمالك و يضمن لك حضوراً فعالاً و تواصلاً مستمراً مع عملائك.",
      ],
      title2: "مميزات تصميم تطبيقات الجوال لدى يُمناك الرقمية",
      items: [
        "نقدم تطبيق جوال مطابق لأحدث تقنيات التصميم و البرمجة",
        "نقدم تطبيقات الجوال على كافة المنصات المختلفة ( android – ios – windows phone)",
        "ستحصل على إتفاقية عدم الإفصاح وذلك لحفظ حقوق الفكرة",
        "نقدم تطبيق جوال متوافق مع جميع أجهزة الهواتف الذكية بمختلف إصدارتها",
      ],
      title3: "مميزات اخري",
      items2: [
        "إمكانية ربط تطبيق الجوال الذي نقدمه بموقعك الإلكتروني أو بالبرمجيات الخاصة التي تستخدمها.",
        "رفع التطبيقات على المتاجر الإلكترونية الخاصة بها سواء كان Google play او Apple Store.",
        "نقدم تطبيق جوال يساعدك على تحقيق الإنتشار السريع والوصول إلى الفئة المستهدفة.",
        "نقدم الحماية و الأمان المتكامل للتطبيقات.",
        "نقدم تطبيق جوال قابل للتطوير و لإضافة أي خدمات جديدة في المستقبل.",
        "مراعاة تجربة المُستخدم في التطبيقات التي نقدمها، ليحصل عملائك على أفضل تجربة ممكنة",
        "نوفر تحديثات مجانية لأول سنة لترقية النظام البرمجي.",
        "نقدم دعم فني على مدار السنة.",
        "نسخ إحتياطي مستمر لحفظ ملفاتك",
        "نقدم خدمة التسويق الإلكتروني لتطبيقك لنحقق لك مبيعات و عائد استثماري رائع (بتكلفة إضافية)",
      ],
    },
    {
      title: "ما الذي يجعل يُمناك أفضل خدمة تصميم تطبيقات الجوال ",
      body: [
        "نحن الوجهة المثلى لتنفيذ مشاريعكم حيث لدينا خبرة كبيرة في مجال إنشاء تطبيقات الجوال و التي تضمن لكم حضوراً فعالاً وتواصلاً مستمراً مع عملائكم، و كل ذلك من منطلق فهمنا العميق للسوق المحلي",
        "نمتلك مهارات إبداعية و فنية رائعة في تنفيذ مشاريع تصميم وبرمجة تطبيقات الجوال للأندرويد والأيفون معتمدين في ذلك على فريق عمل مميز من ذو الخبرات العاليه",
        "لدينا جميع الإمكانيات التي تساعدكم في تحويل أفكاركم إلى تطبيق جوال ناجح حيث نعمل معكم جنباً إلى جنب لتحقيق رؤيتكم و أهدافكم, و ذلك بأسعار تنافسية تتناسب مع ميزانياتكم",
        "بالإضافة إلى ذلك لدينا سابقة أعمال تشهد على حجم إمكانياتنا القوية في مجال تصميم تطبيقات الجوال حيث ساهمنا في إنشاء حلول ذات قيمة مضافة, حلول متميزة و مبتكرة كانت سبب في خلق قصص نجاح رائعة لشركائنا.",
        "نأخذ في يُمناك على عاتقنا مسؤولية تحقيق رؤيتنا و تطبيق قيمنا التي نؤمن بها وذلك من خلال الإبتكار و الإلتزام و الشفافية في التعامل لكسب ثقة عملائنا و ضمان حقوقهم و العناية بهم فنحن واثقون بأن العناية بعملائنا هو من أهم عوامل نجاحنا حيث نعمل مع عملائنا كـشركاء داعمين مدركين بأن نجاحهم هو نجاح لنا في المقام الأول.",
      ],
      title2: "مراحل برمجة وتصميم تطبيقات الجوال لدى يُمناك",
      itemsWithMuted: [
        {
          item: "طلب الخدمة",
          muted: "التقدم بطلب إنشاء تطبيق جوال",
        },
        {
          item: "التحليل",
          muted:
            "فهم و تحليل فكرة و أهداف التطبيق، و وضع تصور كامل لما سيكون عليه، ثم نقوم بعد ذلك بتجهيز الأفكار و الخطط التنفيذية و إنشاء وثيقة الخطط  و المتطلبات النهائية والموافقة عليها من قبلك",
        },
        {
          item: "التصميم",
          muted:
            "وضع أكثر من تصور للتصميم بناءاً على الأفكار و الخطط على أن يتم اختيار التصميم المثالي ومن ثم إعتماده من قبلك",
        },
        {
          item: "التطوير",
          muted:
            "تحويل ملفات التصميم إلى برمجة متكاملة من لوحة تحكم وقواعد بيانات",
        },
        {
          item: "الجودة",
          muted: "تحويل ملفات التصميم إلى برمجة متكاملة من لوحة تحكم و غيره",
        },
        {
          item: "اختبار الجودة",
          muted:
            "نقوم بتقييم وإختبار التطبيق على مختلف الأجهزة للتأكد من عمله على أكمل وجه",
        },
        {
          item: "التسليم",
          muted:
            "تسليمك التطبيق النهائي، و رفعة على المتاجر و من ثم تدريبك على إستخدام النظام بشكل كامل",
        },
      ],
    },
  ],
};

const ServiceName = ({ mainData, service }) => {
  const { query } = useRouter();
  const { id } = query;

  return (
    <>
      <Head>
        <title>يمناك - {service.name}</title>
        <meta name="description" content={service.description} />
        <meta name="keywords" content={service.kewords} />
      </Head>

      <CurrentService id={id} mainData={mainData} service={service} />
    </>
  );
};

export default ServiceName;

export const getServerSideProps = async ({ params }) => {
  const { id, name } = params;

  const { data: service } = await axios(`${API}/api/get/getServiceById/${id}`);

  console.log(service);

  if (service.code != 200) {
    return {
      redirect: {
        permanent: false,
        destination: `/404`,
      },
    };
  }

  const validTitle = service.name.toString().replaceAll(" ", "+");

  if (name != validTitle) {
    return {
      redirect: {
        permanent: false,
        destination: `/services/${id}/${encodeURI(validTitle)}`,
      },
    };
  }

  const data = await getMainData();

  return {
    props: {
      mainData: data,
      service: service,
    },
  };
};
