import React from "react";

import MainService from "../../components/services/MainService";
import getMainData from "../../utils/getMainData";
import Head from "next/head";

const service = {
  description: `
<br />خصوصيتك مهمة بالنسبة لنا. تتمثل سياسة يُمناك في احترام خصوصيتك والامتثال لأي قانون ولوائح معمول بها فيما يتعلق بأي معلومات شخصية قد نجمعها عنك، بما في ذلك عبر موقعنا الإلكتروني، https://uomnaac.com، والمواقع الأخرى التي نمتلكها ونديرها.
<br />
<br />
<br />المعلومات التي نجمعها
<br />تتضمن المعلومات التي نجمعها كلاً من المعلومات التي تزودنا بها عن قصد وفعالية عند استخدام أو المشاركة في أي من خدماتنا و عروضنا الترويجية، وأي معلومات يتم إرسالها تلقائيًا بواسطة أجهزتك أثناء الوصول إلى منتجاتنا وخدماتنا.
<br />
<br />تسجيل البيانات
<br />عندما تزور موقعنا، قد تقوم خوادمنا تلقائيًا بتسجيل البيانات القياسية التي يوفرها متصفح الويب الخاص بك. قد يتضمن عنوان بروتوكول الإنترنت (IP) الخاص بجهازك، ونوع المتصفح وإصداره، والصفحات التي تزورها، ووقت وتاريخ زيارتك، والوقت الذي تقضيه في كل صفحة، وتفاصيل أخرى حول زيارتك، والتفاصيل الفنية التي تحدث بالتزامن مع أي أخطاء قد تواجهها.
<br />
<br />يرجى العلم أنه على الرغم من أن هذه المعلومات قد لا تكون معرّفة بشكل شخصي في حد ذاتها، فقد يكون من الممكن دمجها مع بيانات أخرى لتحديد الأشخاص بشكل شخصي.
<br />
<br />معلومات شخصية
<br />قد نطلب معلومات شخصية قد تتضمن واحدًا أو أكثر مما يلي:
<br />
<br />اسم
<br />بريد إلكتروني
<br />رقم الهاتف / الجوال
<br />أسباب مشروعة لمعالجة معلوماتك الشخصية
<br />نحن نجمع معلوماتك الشخصية ونستخدمها فقط عندما يكون لدينا سبب مشروع للقيام بذلك. في هذه الحالة، نقوم فقط بجمع المعلومات الشخصية الضرورية بشكل معقول لتقديم خدماتنا لك.
<br />
<br />جمع واستخدام المعلومات
<br />قد نقوم بجمع معلومات شخصية منك عندما تقوم بأي مما يلي على موقعنا الإلكتروني:
<br />
<br />تستخدم جهازًا محمولاً أو مستعرض ويب للوصول إلى المحتوى الخاص بنا
<br />تتصل بنا عبر البريد الإلكتروني أو وسائل التواصل الاجتماعي أو أي تقنيات مماثلة
<br />عندما تذكرنا على وسائل التواصل الاجتماعي
<br />يجوز لنا جمع المعلومات والاحتفاظ بها واستخدامها والإفصاح عنها للأغراض التالية، ولن تتم معالجة المعلومات الشخصية مرة أخرى بطريقة لا تتوافق مع هذه الأغراض:
<br />
<br />لتمكينك من تخصيص أو تخصيص تجربتك على موقعنا الإلكتروني
<br />للاتصال بك والتواصل معك
<br />للتحليلات وأبحاث السوق وتطوير الأعمال، بما في ذلك تشغيل وتحسين موقعنا على الويب والتطبيقات المرتبطة ومنصات الوسائط الاجتماعية المرتبطة به
<br />للإعلان والتسويق، بما في ذلك إرسال معلومات ترويجية حول منتجاتنا وخدماتنا ومعلومات حول الجهات الخارجية التي نعتبرها قد تهمك
<br />للنظر في طلب التوظيف الخاص بك
<br />للأمان ومنع الاحتيال، ولضمان أن مواقعنا وتطبيقاتنا آمنة ومأمونة وتستخدم بما يتماشى مع شروط الاستخدام الخاصة بنا
<br />يرجى العلم أننا قد نجمع المعلومات التي نجمعها عنك مع المعلومات العامة أو بيانات البحث التي نتلقاها من مصادر أخرى موثوقة.
<br />
<br />أمن معلوماتك الشخصية
<br />عندما نقوم بجمع المعلومات الشخصية ومعالجتها، وبينما نحتفظ بهذه المعلومات، سنقوم بحمايتها ضمن الوسائل المقبولة تجاريًا لمنع الضياع والسرقة، فضلاً عن الوصول غير المصرح به أو الكشف أو النسخ أو الاستخدام أو التعديل.
<br />
<br />على الرغم من أننا سنبذل قصارى جهدنا لحماية المعلومات الشخصية التي تزودنا بها، إلا أننا ننصح بعدم وجود وسيلة نقل أو تخزين إلكترونية آمنة بنسبة 100٪، ولا يمكن لأحد أن يضمن أمان البيانات المطلق. سنلتزم بالقوانين المطبقة علينا فيما يتعلق بأي خرق للبيانات.
<br />
<br />أنت مسؤول عن اختيار أي كلمة مرور وقوتها الأمنية الشاملة، مما يضمن أمان معلوماتك الخاصة ضمن حدود خدماتنا.
<br />
<br />كم من الوقت نحتفظ بمعلوماتك الشخصية
<br />نحتفظ بمعلوماتك الشخصية فقط للمدة التي نحتاجها. قد تعتمد هذه الفترة الزمنية على ما نستخدم معلوماتك من أجله، وفقًا لسياسة الخصوصية هذه. إذا لم تعد معلوماتك الشخصية مطلوبة، فسنحذفها أو نجعلها مجهولة الهوية عن طريق إزالة جميع التفاصيل التي تحدد هويتك.
<br />
<br />ومع ذلك، إذا لزم الأمر، قد نحتفظ بمعلوماتك الشخصية من أجل امتثالنا لالتزام قانوني أو محاسبي أو إبلاغ أو لأغراض الأرشفة للمصلحة العامة أو لأغراض البحث العلمي أو التاريخي أو لأغراض إحصائية.
<br />
<br />خصوصية الأطفال
<br />لا نوجه أيًا من منتجاتنا أو خدماتنا إلى الأطفال الذين تقل أعمارهم عن 13 عامًا بشكل مباشر، ولا نجمع عن قصد معلومات شخصية عن الأطفال دون سن 13 عامًا.
<br />
<br />إفشاء المعلومات الشخصية لأطراف ثالثة
<br />قد نكشف عن المعلومات الشخصية إلى:
<br />
<br />شركة أم أو شركة تابعة لها أو شركة تابعة لشركتنا
<br />مزودي خدمات الطرف الثالث بغرض تمكينهم من تقديم خدماتهم، على سبيل المثال، موفرو خدمات تكنولوجيا المعلومات، أو تخزين البيانات، أو مزودو الاستضافة والخوادم، أو المعلنون، أو منصات التحليلات
<br />موظفينا ومقاولينا و / أو الكيانات ذات الصلة
<br />وكلائنا الحاليين أو المحتملين أو شركائنا التجاريين
<br />الرعاة أو المروجين لأي مسابقة أو يانصيب أو ترويج نقوم به
<br />المحاكم والهيئات القضائية والسلطات التنظيمية وموظفي إنفاذ القانون، وفقًا لما يقتضيه القانون، فيما يتعلق بأي إجراءات قانونية فعلية أو محتملة، أو من أجل إنشاء أو ممارسة أو الدفاع عن حقوقنا القانونية
<br />الأطراف الثالثة، بما في ذلك الوكلاء أو المقاولون من الباطن، الذين يساعدوننا في توفير المعلومات أو المنتجات أو الخدمات أو التسويق المباشر لك لأطراف ثالثة لجمع البيانات ومعالجتها
<br />التحويلات الدولية للمعلومات الشخصية
<br />يتم تخزين المعلومات الشخصية التي نجمعها و / أو معالجتها حيث نحتفظ نحن أو شركاؤنا والشركات التابعة لنا وموفرو الطرف الثالث بمرافق. يرجى العلم أن المواقع التي نقوم بتخزين معلوماتك الشخصية أو معالجتها أو نقلها إليها قد لا يكون لها نفس قوانين حماية البيانات مثل الدولة التي قدمت فيها المعلومات في البداية. إذا قمنا بنقل معلوماتك الشخصية إلى أطراف ثالثة في بلدان أخرى: (1) سنقوم بإجراء عمليات النقل هذه وفقًا لمتطلبات القانون المعمول به ؛ و (2) سنحمي المعلومات الشخصية المنقولة وفقًا لسياسة الخصوصية هذه.
<br />
<br />حقوقك والتحكم في معلوماتك الشخصية
<br />تحتفظ دائمًا بالحق في حجب المعلومات الشخصية عنا، مع العلم أن تجربتك على موقعنا الإلكتروني قد تتأثر. لن نميز ضدك بسبب ممارسة أي من حقوقك على معلوماتك الشخصية. إذا قمت بتزويدنا بمعلومات شخصية، فأنت تدرك أننا سنجمعها ونحتفظ بها ونستخدمها ونكشف عنها وفقًا لسياسة الخصوصية هذه. تحتفظ بالحق في طلب تفاصيل أي معلومات شخصية نحتفظ بها عنك.
<br />
<br />إذا تلقينا معلومات شخصية عنك من طرف ثالث، فسنقوم بحمايتها على النحو المنصوص عليه في سياسة الخصوصية هذه. إذا كنت طرفًا ثالثًا يقدم معلومات شخصية عن شخص آخر، فأنت تقر وتضمن أن لديك موافقة هذا الشخص على تقديم المعلومات الشخصية إلينا.
<br />
<br />إذا كنت قد وافقت مسبقًا على استخدامنا لمعلوماتك الشخصية لأغراض التسويق المباشر، فيمكنك تغيير رأيك في أي وقت. سنوفر لك القدرة على إلغاء الاشتراك من قاعدة بيانات البريد الإلكتروني الخاصة بنا أو إلغاء الاشتراك في الاتصالات. يرجى العلم أننا قد نحتاج إلى طلب معلومات محددة منك لمساعدتنا في تأكيد هويتك.
<br />
<br />إذا كنت تعتقد أن أي معلومات نحتفظ بها عنك غير دقيقة أو قديمة أو غير كاملة أو غير ذات صلة أو مضللة، فيرجى الاتصال بنا باستخدام التفاصيل الواردة في سياسة الخصوصية هذه. سنتخذ خطوات معقولة لتصحيح أي معلومات يتبين أنها غير دقيقة أو غير كاملة أو مضللة أو قديمة.
<br />
<br />إذا كنت تعتقد أننا انتهكنا قانون حماية البيانات ذي الصلة وترغب في تقديم شكوى، فيرجى الاتصال بنا باستخدام التفاصيل أدناه وتزويدنا بالتفاصيل الكاملة للانتهاك المزعوم. سنحقق على الفور في شكواك ونرد عليك كتابيًا ونحدد نتيجة تحقيقنا والخطوات التي سنتخذها للتعامل مع شكواك. لديك أيضًا الحق في الاتصال بهيئة تنظيمية أو سلطة حماية البيانات فيما يتعلق بشكواك.
<br />
<br />حدود سياستنا
<br />قد يرتبط موقعنا الإلكتروني بمواقع خارجية لا نقوم بتشغيلها. يرجى العلم أنه ليس لدينا أي سيطرة على محتوى وسياسات تلك المواقع، ولا يمكننا قبول المسؤولية أو المسؤولية عن ممارسات الخصوصية الخاصة بكل منها.
<br />
<br />التغييرات على هذه السياسة
<br />وفقًا لتقديرنا، قد نقوم بتغيير سياسة الخصوصية الخاصة بنا لتعكس تحديثات عملياتنا التجارية أو الممارسات الحالية المقبولة أو التغييرات التشريعية أو التنظيمية. إذا قررنا تغيير سياسة الخصوصية هذه، فسننشر التغييرات هنا على نفس الرابط الذي تصل من خلاله إلى سياسة الخصوصية هذه.
<br />
<br />إذا كان ذلك مطلوبًا بموجب القانون، فسنحصل على إذن منك أو نمنحك الفرصة للاشتراك أو إلغاء الاشتراك، حسب الاقتضاء، في أي استخدامات جديدة لمعلوماتك الشخصية.
<br />
<br />اتصل بنا
<br />لأية أسئلة أو مخاوف بشأن خصوصيتك، يمكنك الاتصال بنا باستخدام التفاصيل التالية:
<br />
<br /><a href="mailto: contact@uomnaac.com">CONTACT@UOMNAAC.COM</a>`,
};

const privacyPolicy = ({ mainData }) => {
  return (
    <>
      <Head>
        <title>يمناك - سياسة الخصوصية</title>
      </Head>

      <MainService
        mainClassName="mt-5"
        noCard
        mainData={mainData}
        service={service}
        descriptionClass="text-muted px-3 text-md"
        heading="سياسة الخصوصية"
      />
    </>
  );
};

export default privacyPolicy;

export const getServerSideProps = async () => {
  const data = await getMainData();

  return {
    props: {
      mainData: data,
    },
  };
};
