import React from "react";

import MainService from "../../components/services/MainService";
import getMainData from "../../utils/getMainData";
import Head from "next/head";

const service = {
  description: `يخضع استخدام هذا الموقع للشروط التالية:
  <br />
  <br />محتوى صفحات هذا الموقع هو لمعلوماتك العامة واستخدامها فقط حيث أنه يخضع للتغيير دون إشعار.
  <br />هذا الموقع يستخدم ملفات التعريف لمراقبة تفضيلات التصفح. إذا سمحت باستخدام ملفات تعريف الارتباط، فقد يتم تخزين المعلومات الشخصية من قبلنا لاستخدامها من قبل أطراف ثالثة.
  <br />لا نقدم نحن ولا أي طرف ثالث أي ضمان فيما يتعلق بدقة وتوقيت أو أداء أو اكتمال أو ملاءمة المعلومات والمواد الموجودة أو المعروضة على هذا الموقع لأي غرض معين. نقر بأن مثل هذه المعلومات والمواد قد تحتوي على معلومات غير دقيقة أو أخطاء، ونحن لا نتحمل المسؤولية عن أي من هذه الأخطاء إلى أقصى حد يسمح به القانون.
  <br />إن استخدامك لأي معلومات أو مواد على هذا الموقع يكون على مسؤوليتك الخاصة بالكامل، ولن نتحمل المسؤولية تجاهه. تقع على عاتقك مسؤولية التأكد من أن أي منتجات أو خدمات أو معلومات متاحة من خلال هذا الموقع تفي بمتطلباته المحددة.
  <br />يحتوي هذا الموقع على مواد مملوكة أو مرخصة لنا. تشمل هذه المواد، على سبيل المثال لا الحصر، على التصميم والتخطيط والشكل والمظهر والرسومات. يحظر النسخ إلا وفقًا لأحكام حقوق الطبع والنشر، والذي يشكل جزءًا من هذه الأحكام.
  <br />يتم الاعتراف بجميع العلامات التجارية المستخدمة في هذا الموقع والتي ليست مملوكة أو مرخصة.
  <br />الاستخدام غير المصرح به لهذا الموقع قد يؤدي إلى مطالبة بالتعويض عن الأضرار و / أو يكون جريمة جنائية.
  <br />قد يشتمل هذا الموقع أيضًا على روابط لمواقع أخرى. يتم توفير هذه الروابط من وقت لآخر لراحتك لتقديم مزيد من المعلومات. لا تعني هذه الروابط أننا نؤيد الموقع (المواقع). لا نتحمل أي مسؤولية عن محتوى الموقع (المواقع) المرتبطة بهذا الموقع.`,
};

const termsOfUse = ({ mainData }) => {
  return (
    <>
      <Head>
        <title>يمناك - شروط الاستخدام</title>
      </Head>

      <MainService
        mainClassName="mt-5"
        noCard
        mainData={mainData}
        service={service}
        descriptionClass="text-muted px-3 text-md"
        heading="شروط الاستخدام"
      />
    </>
  );
};

export default termsOfUse;

export const getServerSideProps = async () => {
  const data = await getMainData();

  return {
    props: {
      mainData: data,
    },
  };
};
